In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('join_practice.db')

Q1. INNER JOIN

In [3]:
pd.read_sql("""SELECT Product.ProductName, Category.CategoryName, Supplier.SupplierName
FROM Product
INNER JOIN Category ON Product.CategoryID = Category.CategoryID
INNER JOIN Supplier ON Product.SupplierID = Supplier.SupplierID;""",conn)

  ProductName CategoryName    SupplierName
0  Smartphone  Electronics  TechSource Ltd
1          TV  Electronics  TechSource Ltd
2      Apples    Groceries    FreshFarm Co
3       Bread    Groceries    FreshFarm Co
4        Sofa    Furniture   HomeStyle Inc

Q2. Filter by supplier country

In [4]:
pd.read_sql("""SELECT ProductName, SupplierName, Country
FROM Product
JOIN Supplier USING (SupplierID)
WHERE Country = 'Kenya';""",conn)

  ProductName  SupplierName Country
0      Apples  FreshFarm Co   Kenya
1       Bread  FreshFarm Co   Kenya

Q3. Products with their category only (LEFT JOIN)

In [5]:
pd.read_sql("""SELECT ProductName, CategoryName
FROM Product
LEFT JOIN Category ON Product.CategoryID = Category.CategoryID;""",conn)

  ProductName CategoryName
0  Smartphone  Electronics
1          TV  Electronics
2      Apples    Groceries
3       Bread    Groceries
4        Sofa    Furniture

Average price per category

In [6]:
pd.read_sql("""SELECT CategoryName, AVG(UnitPrice) AS AvgPrice
FROM Product
JOIN Category ON Product.CategoryID = Category.CategoryID
GROUP BY CategoryName;""",conn)

  CategoryName  AvgPrice
0  Electronics    650.00
1    Furniture   1200.00
2    Groceries      2.25

tegoryName;
ðŸ§¾ Q5. Count products per supplier

In [7]:
pd.read_sql("""SELECT SupplierName, COUNT(ProductID) AS ProductCount
FROM Supplier
LEFT JOIN Product USING (SupplierID)
GROUP BY SupplierName;""",conn)

     SupplierName  ProductCount
0    FreshFarm Co             2
1   HomeStyle Inc             1
2  TechSource Ltd             2